Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: This assumes there is such a driver for your particular keyboard or mouse and that you can live without the features provided by its custom driver and software.
pt_br: Isto pressupõe que existe um driver para seu teclado ou mouse em particular e que você tolera ficar numa boa sem as funcionalidades fornecidas pelo software e driver personalizado do teclado ou mouse.

source: This assumes there is such a driver for your particular mouse and that you can live without the features provided by your mouse's custom software.
pt_br: Isso assume que existe um driver para seu mouse em particular e que você pode ficar numa boa sem as funcionalidades extras proporcionadas pelo software personalizado do seu mouse.

source: This can be done by applying this registry patch.
pt_br: Isso pode ser feito aplicando-se este patch do registro.

source: This can be fixed by deleting the following registry key:
pt_br: Para consertar isso, delete esta chave de registro:

source: This can cause confusion, so it is recommended that all new scripts use #NoEnv.
pt_br: Isso pode causar confusão, então recomenda-se que todos os novos scripts usem #NoEnv.

source: This command literally sends keystrokes, to simulate typing or pressing of keys.
pt_br: Este comando literalmente envia o pressionamento de teclas, para simular a digitação ou o simples pressionamento de quaisquer teclas do teclado.

source: This context menu option provides a workaround for common UAC-related issues by allowing the script to automate administrative programs - without the script running as admin.
pt_br: Essa opção de menu contextual provê um contorno para problemas comuns relacionados ao UAC ao permitir que o script automatize programas administrativos - sem que o script esteja executando como administrador.

source: This document covers some general concepts and conventions used by AutoHotkey, with focus on explanation rather than code.
pt_br: Este documento cobre alguns conceitos gerais e convenções usadas pelo AutoHotkey, num artigo focado mais na explicação do que no código.

source: This doesn't remove the key, but it will make the value appear identical to an unset value.
pt_br: Isso não remove a chave, mas fará o valor se parecer idêntico a um valor que ainda não foi definido.

source: This helps the script to behave consistently across multiple locales.
pt_br: Isso ajuda o script a se comportar de maneira consistente entre múltiplas configurações regionais.

source: This is an expression assignment, due to the : before the =.
pt_br: Esta é uma atribuição de expressão, devido ao : antes do =.

source: This is because ^A presses Ctrl+Shift+A and ^a presses Ctrl+A.
pt_br: Isso é porque ^A pressiona Ctrl+Shift+A enquanto ^a pressiona Ctrl+A.

source: This is because !A presses Alt+Shift+A and !a presses Alt+A.
pt_br: Isso é porque !A faz pressionar Alt+Shift+A e !a faz pressionar Alt+A.

source: This is because the Text mode typically does not depend on the state of CapsLock and cannot trigger the system Win+L hotkey.
pt_br: Isso é porque o modo Texto tipicamente não depende do estado do CapsLock e não pode desencadear a tecla de atalho Win+L do sistema.

source: This is because the chance of success is low and it may cause unwanted side-effects that are difficult to undo:
pt_br: Isso porque sua chance de sucesso é baixa e este método pode causar efeitos colaterais indesejados que são difíceis de serem desfeitos:

source: This is both for backward-compatibility and because the script could change the value indirectly via its address at any time, making the cache inaccurate.
pt_br: Isso é tanto para retrocompatibilidade e também porque o script poderia mudar o valor indiretamente por meio do endereço da variável a qualquer momento, tornando o cache impreciso.

source: This is called a block.
pt_br: Isso é chamado de bloco.

source: This is described on the remapping page.
pt_br: Isso está descrito na página de remapeamento de teclas.

source: This is done to prevent any owned windows (such as GUI windows or certain dialog windows) from automatically being minimized, but also has the effect of hiding the main window's taskbar button.
pt_br: Isso é feito para prevenir que quaisquer janelas criadas pelo script (como janelas de GUI ou certas janelas de diálogo) sejam automaticamente minimizadas, mas também tem o efeito de ocultar o botão da janela principal da barra de tarefas.

source: This is equivalent to the brace syntax, but wrapped in a function.
pt_br: A forma acima é equivalente à sintaxe com chaves, mas envolta em uma função.

source: This is equivalent to the bracket syntax, but wrapped in a function.
pt_br: A forma acima é equivalente à sintaxe com colchetes, mas envolta em uma função.

source: This is how a lot of "pros" have learned.
pt_br: Foi assim que muitos “prós” aprenderam.

source: This is not recommended, and is not feasible on Windows 8 or later.
pt_br: Isso não é recomendado e não é viável no Windows 8 e posteriores.

source: This is perfectly fine since the if-statement only had one line of code associated with it.
pt_br: Essa forma sem chaves funcionou perfeitamente pois a instrução com if só tinha uma linha de código associada a ela.

source: This is referred to as the native encoding.
pt_br: Isso é chamado aqui de codificação nativa.

source: This is similar to how the InsertAt method with multiple specified values works.
pt_br: Isso é similar ao funcionamento do método InsertAt com múltiplos valores especificados.

source: This is the key that invokes the right-click context menu.
pt_br: Esta é a tecla que invoca o menu de contexto ao se clicar com o botão direito.

source: This is the means by which a compiled script is created from an .exe file.
pt_br: Esse é o modo pelo qual um script compilado é criado a partir de um arquivo .exe.

source: This is the simplest form for a variable, a legacy assignment.
pt_br: Esta é a forma mais simples para uma variável: a atribuição legada.

source: This is true for every type of object, so it is always possible to compute the name of a property or method at runtime, rather than hard-coding it into the script.
pt_br: Isso é verdade para todo tipo de objeto, então é sempre possível computar o nome de uma propriedade ou método em tempo de execução, em vez de codificá-lo no script.

source: This isn't the only way, but the most common.
pt_br: Essa não é a única forma, mas a mais comum.

source: This may lead to unexpected results.
pt_br: Isso pode levar a resultados inesperados.

source: This means that you need percent signs around a variable, such as %Var%, and that any text and numbers do not need to be in quotation marks, such as This is some text.
pt_br: Isso significa que você precisa usar sinais de porcentagem em volta do nome de uma variável, como em %Var%, e que nenhum texto ou números precisa estar entre aspas, como em Isto é um texto.

source: This might also help us and other AutoHotkey users, as the vendor may confirm it is a false positive and fix their product to play nice with AutoHotkey.
pt_br: Isso também pode ajudar outros usuários do AutoHotkey, já que a empresa do antivírus pode confirmar o arquivo como um falso positivo e consertar o produto deles para conviver de boa com o AutoHotkey.

source: This mode can be combined with the Blind mode to avoid releasing any modifier keys:
pt_br: Esse modo pode ser combinado com o modo Cego para evitar a soltura de quaisquer teclas modificadoras:

source: This old car will be dangerous to drive.
pt_br: Este carro estará perigoso de dirigir.

source: This only lets you use literal strings for the keys.
pt_br: Esta notação permite somente que você use strings literais para as chaves.

source: This option can be enabled or disabled without reinstalling AutoHotkey by re-running AutoHotkey Setup from the Start menu.
pt_br: Essa opção pode ser habilitada ou desabilitada sem reinstalar o AutoHotkey ao se reexecutar o instalador a partir do Menu Iniciar.

source: This page contains information about the currently used version, the authors, the license, and a quick overview of the documentation.
pt_br: Esta página contém informações sobre a versão atual, os autores, a licença e uma breve visão geral da documentação.

source: This page lists all mouse buttons, keyboard keys and joystick buttons which can be used for hotkeys and key-specific commands/functions.
pt_br: Esta página lista todos os botões de mouse, teclas do teclado e botões do joystick, todos os quais podem ser usados para hotkeys e comandos e funções específicos de tais teclas/botões.

source: This page lists questions and answers about language syntax, general troubleshooting, common tasks, hotkeys, hotstrings and remapping.
pt_br: Esta página lista perguntas e respostas sobre a sintaxe da linguagem, resolução de problemas em geral, tarefas comuns, teclas de atalho (hotkeys), hotstrings e remapeamento de teclas.

source: This prefix must be written after the + or - sign, if present, and before any leading zeroes.
pt_br: Esse prefixo deve ser escrito depois do sinal de + ou -, se presente, e antes de quaisquer zeros à esquerda.

source: This probably doesn't exist on most keyboards.
pt_br: Esta tecla provavelmente não existe na maioria dos teclados.

source: This process is called "Scripting".
pt_br: Esse processo é chamado “scripting” ou “desenvolvimento de scripts”.

source: This rarely-used method also prevents certain types of hotkeys from requiring the keyboard hook.
pt_br: Este método, raramente usado, também dispensa certos tipos de hotkeys da exigência do gancho de teclado.

source: This removes all keys from Index to Index + Length - 1 (inclusive).
pt_br: Esse método remove todas as chaves do intervalo Indice até Indice - Comprimento - 1 (inclusive).

source: This removes the highest integer key, and returns the value.
pt_br: Este remove a maior chave inteira e retorna seu valor.

source: This script is executed automatically and most command line switches are passed to the script instead of being interpreted by the program.
pt_br: Esse script é executado automaticamente e a maioria das opções da linha de comando são passadas ao script em vez de serem interpretadas pelo programa.

source: This section builds on these concepts which are covered in later sections:
pt_br: Esta seção se baseia nos conceitos seguintes, que são cobertos em seções posteriores:

source: This stuff (indentation) is very important!
pt_br: Esse negócio de indentação é muito importante!

source: This style allows people familiar with other computer languages to understand your scripts more easily.
pt_br: Esse estilo permite que pessoas familiarizadas com outras linguagens entendam seus scripts mais facilmente.

source: This table shows the default function of each key on most versions of Windows.
pt_br: A tabela abaixo mostra a função padrão de cada tecla na maioria das versões do Windows.

source: This will become your best friend.
pt_br: Esta palavra aí vai ser sua melhor amiga.

source: This will let you start of by defining what is sometimes called an "associative array".
pt_br: A forma acima permite que você defina um “vetor associativo”.

source: This will open the Startup folder for the current user.
pt_br: Isso irá abrir a pasta Inicializar do usuário atual.

source: This will prevent many issues when you start having a lot of stuff in your scripts.
pt_br: Isso vai prevenir muitos problemas quando você começar a ter um cadinho de coisas em seus scripts.

source: This will shift ALL higher integer keys up by the number of values which were inserted, even if there are gaps (for example, only keys 1 and 100 exist, and you insert a value at key 50, it will shift 100 up to 101).
pt_br: Isso vai “empurrar para frente” TODAS as chaves inteiras, adicionando a cada uma delas o número de valores que foram inseridos, mesmo se houver lacunas (por exemplo, somente as chaves 1 a 100 existem e você insere um valor na chave de índice 50, o que elevará o número 100 para 101).

source: This will start you off with what is sometimes called an "indexed array".
pt_br: Isso o iniciará naquilo que se chama “vetor indexado”.

source: This would normally be done to prevent Send from triggering the system "lock workstation" hotkey (Win+L).
pt_br: Isso normalmente seria feito para impedir o Send de desencadear a tecla de atalho do Windows “bloquear computador” (Win+L).

source: This, for some reason crosses some people's minds.
pt_br: Esta ideia, por alguma razão, passa pela cabeça de alguns.

source: Those are a bit advanced and are covered more in-depth here:
pt_br: Esses critérios são um pouco avançados e são cobertos em maior profundidade aqui:

source: Throughout the documentation, you will see these two symbols ([ and ]) surrounding code in the yellow syntax box at the top of almost all pages.
pt_br: Ao longo desta documentação, você verá estes dois símbolos ([ e ]) em volta do código no espaço amarelo da sintaxe no topo da maioria das páginas.

source: Throughout this documentation, some common words are used in ways that might not be obvious to someone without prior experience.
pt_br: Ao longo desta documentação, algumas palavras comuns são usadas de maneiras que podem não ser óbvias para alguém sem experiência prévia.

source: Throughout this tutorial you will see a lot of text and a lot of code.
pt_br: Ao longo deste tutorial você verá muito texto e muito código.

source: Title Expression
pt_br: Expressão do Título

source: To suspend, pause or reload another script, replace the last line above with one of these:
pt_br: Para suspender, pausar ou recarregar outro script, substitua a linha acima com uma destas:

source: To initialise a variable is to assign it a starting value.
pt_br: Inicializar uma variável é atribuir a ela um valor inicial.

source: To achieve this, the installer does the following:
pt_br: Para conseguir isso, o instalador faz o seguinte:

source: To add new keys and values:
pt_br: Para adicionar novas chaves e valores:

source: To always perform a logical left click, use Click Left or Send {Click Left}.
pt_br: Caso você queira sempre executar um clique lógico do botão esquerdo, use Click Left ou Send {Click Left}.

source: To always perform a logical right click, use Click Right or Send {Click Right}.
pt_br: Caso você queira sempre executar um clique lógico do botão direito, use Click Right ou Send {Click Right}.

source: To avoid using a temporary file (especially if the output is large), consider using the Shell.Exec() method as shown in the examples for the Run command.
pt_br: Para evitar o uso de um arquivo temporário (especialmente se a saída for grande), considere usar o método Shell.Exec() como mostrado nos exemplos do comando Run.

source: To configure a script to start automatically after the user logs in, the easiest way is to place a shortcut to the script file in the Startup folder.
pt_br: Para configurar um script para iniciar automaticamente depois de o usuário fazer login, o jeito mais fácil é colocar um atalho para o arquivo do script na pasta Inicializar.

source: To define this key as a hotkey, follow this example:
pt_br: Para definir essa tecla como uma hotkey, siga o exemplo abaixo:

source: To determine the amount of time between two dates or times, see EnvSub, which gives an example.
pt_br: Para determinar a quantidade de tempo entre duas datas ou horários, veja EnvSub, que contém um exemplo.

source: To directly add a key and value, just set a key that doesn't exist yet.
pt_br: Para diretamente adicionar uma chave e um valor, basta definir uma chave que não existe ainda.

source: To do this, include the following line near the top of the script:
pt_br: Para fazer isso, inclua a linha a seguir perto do topo do script:

source: To do this, you will need to use either of these fancy commands with a # in-front of them:
pt_br: Para fazer isso, você precisará usar um destes comandos garbosos com um símbolo # na frente deles:

source: To help determine the button numbers for your joystick, use this test script.
pt_br: Para ajudar a determinar os números dos botões de seu joystick, use este script de teste.

source: To help you learn what ^ and other symbols mean, gaze upon this chart:
pt_br: Para ajudá-lo a aprender o que ^ e outros símbolos significa, observe esta tabela:

source: To hold down or release a key, enclose the key name in curly brackets and then use the word UP or DOWN.
pt_br: Para segurar ou soltar uma tecla, envolva o nome da tecla em chaves e aí use as palavras UP ou DOWN.

source: To hold down the left or right key instead, use {RAlt down} and {RAlt up}.
pt_br: Para, em vez disso, segurar a tecla esquerda ou direita, use {RAlt down} e {RAlt up}.

source: To hold down the left or right key instead, use {RCtrl down} and {RCtrl up}.
pt_br: Para, em vez disso, segurar a tecla esquerda ou direita, use {RCtrl down} e {RCtrl up}.

source: To instead allow the main window to be minimized normally, override the default handling with OnMessage.
pt_br: Para, em vez disso, fazer com que a janela seja minimizada normalmente, use OnMessage para sobrescrever a forma padrão de manipulação de janelas.

source: To instead open the folder for all users, enter shell:common startup (however, in that case you must be an administrator to proceed).
pt_br: Se, em vez disso, você quiser abrir a pasta Inicializar comum a todos os usuários, digite shell:common startup (entretanto, neste caso você precisará ser um administrador para proceder).

source: To just press (hold down) or release the key, follow the key name with the word "down" or "up" as shown below.
pt_br: Apenas pressione (segure) ou solte a tecla, e escreva a palavra “down” ou “up” após o nome da tecla (pressionar e soltar, respectivamente), como mostrado abaixo.

source: To learn how, read the tutorial or dive straight in.
pt_br: Para aprender como, leia o tutorial ou pule direto de cabeça.

source: To open a script for editing, right-click on the script file and select Edit Script.
pt_br: Para abrir um script para edição, clique com o botão direito no arquivo e selecione Edit Script.

source: To override which version of AutoHotkey.exe is set as the default, pass one of the following switches:
pt_br: Para ignorar qual versão do executável AutoHotkey.exe é definida como a padrão, passe um dos switches a seguir:

source: To pause or resume the entire script at the press of a key, assign a hotkey to the Pause command as in this example:
pt_br: Para pausar ou retomar o script inteiro pressionando uma tecla, atribua a hotkey ao comando Pause como neste exemplo:

source: To read other UTF-8 files which lack a byte order mark, use FileEncoding UTF-8-RAW, the *P65001 option with FileRead, or "UTF-8-RAW" for the third parameter of FileOpen().
pt_br: Para ler outros arquivos UTF-8 que não contêm uma BOM, use o comando FileEncoding UTF-8-RAW, a opção *P65001 com o comando FileRead, ou UTF-8-RAW como terceiro parâmetro da função FileOpen().

source: To remap some other key to become a "mystery key", follow this example:
pt_br: Para remapear alguma outra tecla para tornar-se a “tecla misteriosa”, siga este exemplo:

source: To remove keys and values:
pt_br: Para remover chaves e valores:

source: To resolve this, save the file as UTF-8 with BOM or add the /CP65001 command line switch.
pt_br: Para resolver isso, salve o arquivo como UTF com BOM ou adicione o switch /CP65001 da linha de comando.

source: To retrieve values:
pt_br: Para obter (ou recuperar) valores:

source: To run a program such as mspaint.exe, calc.exe, script.ahk or even a folder, you can use the Run command.
pt_br: Para abrir um programa como mspaint.exe, calc.exe, script.ahk ou até abrir uma pasta, você pode usar o comando Run.

source: To save as UTF-8 with BOM in Notepad, select UTF-8 from the Encoding drop-down in the Save As dialog.
pt_br: Para salvar como UTF-8 com BOM no Bloco de Notas, selecione UTF-8 no menu suspenso Codificação dentro da janela Salvar como.

source: To send the corresponding modifier key on its own, enclose the key name in braces.
pt_br: Para enviar a tecla modificadora correspondente em si, envolva o nome da tecla em chaves.

source: To set values:
pt_br: Para definir valores:

source: To show contents of a variable, use MsgBox or ToolTip.
pt_br: Para exibir o conteúdo de uma variável, use MsgBox ou ToolTip.

source: To silently install AutoHotkey into the default directory (which is the same directory displayed by non-silent mode), pass the parameter /S to the installer.
pt_br: Para instalar silenciosamente o AutoHotkey no diretório padrão (o qual é o mesmo diretório exibido pelo modo não silencioso), passe o parâmetro /S ao instalador.

source: To silently uninstall AutoHotkey, pass the /Uninstall parameter to Installer.ahk.
pt_br: Para desintalar silenciosamente o AutoHotkey, passe o parâmetro /Uninstall ao Installer.ahk.

source: To stop an action that is repeating inside a Loop, consider the following working example, which is a hotkey that both starts and stops its own repeating action.
pt_br: Para interromper uma ação que está se repetindo dentro de um Loop, considere o exemplo funcional abaixo, que é uma hotkey que tanto inicia quanto interrompe sua própria ação repetitiva.

source: To turn off context sensitivity for subsequent hotkeys or hotstrings, specify any #IfWin directive but leave all of its parameters blank.
pt_br: Para desabilitar a “sensibilidade ao contexto” para as hotkeys e hotstrings subsequentes, especifique qualquer diretiva #IfWin mas deixe todos seus parâmetros em branco.

source: To work around this, use %A_WinDir%\SysNative instead; this is a virtual directory only visible to 32-bit programs running on 64-bit systems.
pt_br: Para contornar isso, use %A_WinDir%\SysNative no lugar; esse é um diretório virtual visível somente pelos programas de 32 bits rodando em sistemas de 64 bits.

source: ToolTip, Press Win-Z again to stop this from flashing.
pt_br: ToolTip, Pressione Win-Z de novo para impedir que esta janela fique alertando.

source: Tray Icon
pt_br: Ícone da bandeja

source: Trial and Error
pt_br: Tentativa e erro

source: Trial and Error is a very common and effective way of learning.
pt_br: Tentativa e erro é uma maneira muito comum e eficaz de aprender.

source: Try AHKHID.
pt_br: Tente o AHKHID.

source: Try ControlSend, which might work in cases where the other Send modes fail:
pt_br: Tente ControlSend, o qual pode funcionar nos casos em que os outros modos do comando Send falharem:

source: Try the down and up event of a key with a Sleep between them:
pt_br: Tente o evento de pressionamento e soltura de uma tecla com um Sleep entre eles:

source: Try the down and up event of a key with the various send methods:
pt_br: Tente o evento de pressionamento e soltura de uma tecla com os vários métodos do comando Send:

source: Try, fail, try, fail, try, try, try, fail, fail, succeed!
pt_br: Tente, falhe, tente, falhe, tente, tente, falhe, falhe, consiga!

source: Turn the wheel downward (toward you).
pt_br: Girar a roda do mouse para baixo (em direção a você).

source: Turn the wheel upward (away from you).
pt_br: Girar a roda do mouse para cima (na direção afastando de você).

source: Tutorial for beginners
pt_br: Tutorial para iniciantes

source: Type "Hello, world!"
pt_br: Digitar (enviar teclas) “Olá, mundo!”

source: Typically performs the same function as Browser_Back.
pt_br: Tipicamente executa a mesma função de Browser_Back.

source: Typically performs the same function as Browser_Forward.
pt_br: Tipicamente executa a mesma função de Browser_Forward.

source: UAC may also prevent SendPlay and BlockInput from working.
pt_br: O UAC também impede o funcionamento dos comandos SendPlay e BlockInput.
